"""
Задание 1.
Приведен код, который позволяет сохранить в
массиве индексы четных элементов другого массива
Сделайте замеры времени выполнения кода с помощью модуля timeit
Попробуйте оптимизировать код, чтобы снизить время выполнения
Проведите повторные замеры
ОБЯЗАТЕЛЬНО! Добавьте аналитику: что вы сделали и какой это принесло эффект


def func_1(nums):
    new_arr = []
    for i in range(len(nums)):
        if nums[i] % 2 == 0:
            new_arr.append(i)
    return new_arr
"""

from timeit import timeit
my_list = [i for i in range(1, 101)]
def func_1(nums):
    new_arr = []
    for i in range(len(nums)):
        if nums[i] % 2 == 0:
            new_arr.append(i)
    return new_arr
print(func_1(my_list))
print(timeit("func_1(my_list)", globals=globals(), number=1000))


def func_2(nums):
    my_list2 = [idx for idx, value in enumerate(nums) if value % 2 == 0]
    return my_list2
print(func_2(my_list))
print(timeit("func_2(my_list)", globals=globals(), number=1000))


"""
Уменьшить время получилось через 'list comprehension' во втором варианте.
Т.к. 'list comprehension' быстрее цикла 'for'...плюс исключен метод '.append'.

Первый вариант
[1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99]
0.006266199983656406

Второй вариант
[1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99]
0.004961300001014024


"""